## Missing Data - Pandas

In [1]:
import pandas as pd
import numpy as np

In [31]:

data =  {
    "Col_1": [None,34,np.nan,200],
    "Col_2":[22,np.nan,34,2],
    "Col_3": [100,23,2,2]   
        
}
index = "Row_1 Row_2 Row_3 Row_4".split(" ")

In [32]:
df = pd.DataFrame(data,index=index)

In [33]:
df.loc["Row_1"]

Col_1      NaN
Col_2     22.0
Col_3    100.0
Name: Row_1, dtype: float64

In [34]:
df

       Col_1  Col_2  Col_3
Row_1    NaN   22.0    100
Row_2   34.0    NaN     23
Row_3    NaN   34.0      2
Row_4  200.0    2.0      2

In [36]:
df.dropna(axis=1)

       Col_3
Row_1    100
Row_2     23
Row_3      2
Row_4      2

In [37]:
df.dropna()

       Col_1  Col_2  Col_3
Row_4  200.0    2.0      2

In [43]:
df.dropna(thresh=3,axis=1)

       Col_2  Col_3
Row_1   22.0    100
Row_2    NaN     23
Row_3   34.0      2
Row_4    2.0      2

In [49]:
df.dropna()

       Col_1  Col_2  Col_3
Row_4  200.0    2.0      2

In [57]:
df.dropna(axis=1)

       Col_3
Row_1    100
Row_2     23
Row_3      2
Row_4      2

In [58]:
df

       Col_1  Col_2  Col_3
Row_1    NaN   22.0    100
Row_2   34.0    NaN     23
Row_3    NaN   34.0      2
Row_4  200.0    2.0      2

In [59]:
df.fillna(0)

       Col_1  Col_2  Col_3
Row_1    0.0   22.0    100
Row_2   34.0    0.0     23
Row_3    0.0   34.0      2
Row_4  200.0    2.0      2

In [62]:
df.ffill(axis=0)

       Col_1  Col_2  Col_3
Row_1    NaN   22.0    100
Row_2   34.0   22.0     23
Row_3   34.0   34.0      2
Row_4  200.0    2.0      2

In [63]:
df.ffill(axis=0)

       Col_1  Col_2  Col_3
Row_1    NaN   22.0    100
Row_2   34.0   22.0     23
Row_3   34.0   34.0      2
Row_4  200.0    2.0      2

In [69]:
df["Col_1"] = df["Col_1"].fillna(df["Col_1"].mean())

In [70]:
df

       Col_1  Col_2  Col_3
Row_1  117.0   22.0    100
Row_2   34.0    NaN     23
Row_3  117.0   34.0      2
Row_4  200.0    2.0      2